app/views/books/_comment.html.erb

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
 <table>
  <% @bookfind.book_comments.each do |book_comment| %>