app/controllers/book_comments_controller.rb

  def create
    @bookfind = Book.find(params[:book_id])
    @comment = current_user.book_comments.new(book_comment_params)
    @comment.book_id = @bookfind.id
    @comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "aaa"], ["user_id", 1], ["book_id", 1], ["created_at", "2021-10-03 01:14:17.756725"], ["updated_at", "2021-10-03 01:14:17.756725"]]

  def destroy
    @bookfind = Book.find(params[:book_id])
    @comment = BookComment.find(params[:id])
    @comment.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 19]]