app/controllers/books_controller.rb

  def show
    @book = Book.new
    @bookfind = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]