app/controllers/relationships_controller.rb

INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 1], ["followed_id", 2], ["created_at", "2021-10-03 15:26:37.535349"], ["updated_at", "2021-10-03 15:26:37.535349"]]
---
  def create
    following = current_user.relationships.build(follower_id: params[:user_id])
    following.save

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 1]]
---
  def destroy
    following = current_user.relationships.find_by(follower_id: params[:user_id])
    following.destroy